**Name:** Ahmed Waseem  
**Email:** ahmedwaseem42@gmail.com  
**Github:** Ahmed25142  
**Project:** Python Pandas Data Analysis & Data Cleaning

**Step 1: Install Libraries**  
1. pip install Pandas
2. pip install numpy (Mathematical Calculations; Materices, vestors, etc)

In [31]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [32]:
pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\python313\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

**Step 2:**  
Import Libraries

In [33]:
import pandas as pd
import numpy as np

**Step 3:**   
Loading Dataset

In [34]:
df=pd.read_csv('data.csv')

In [35]:
print(df)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

**Top five list View**

In [36]:
df.head()

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

**Missing Data**

In [37]:
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

**Fill Missing Value**

In [38]:
Median_salary= df['Salary'].median()
df['Salary'].fillna(Median_salary, inplace=True)
print(Median_salary)

70000.0

C:\Users\Ahmed\AppData\Local\Temp\ipykernel_17768\3824114804.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(Median_salary, inplace=True)

In [39]:
median_salary= df['Salary'].median()
df['Salary'].fillna(median_salary, inplace=True)
print(median_salary)

70000.0

C:\Users\Ahmed\AppData\Local\Temp\ipykernel_17768\2530136526.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(median_salary, inplace=True)

In [40]:
print(df)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0    70000.0
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0    70000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [41]:
print(df)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0    70000.0
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0    70000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [42]:
Median_df=df['Age'].fillna(df['Age'].median())

In [43]:
Median_df

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11     30.0
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

In [44]:
Mean_df=df['Age'].fillna(df['Age'].mean())

In [45]:
Mean_df

0      37.0000
1      30.0000
2      29.0000
3      30.0000
4      25.0000
5      22.0000
6      29.0000
7      26.0000
8      28.0000
9      55.0000
10     60.0000
11     48.6875
12    156.0000
13     67.0000
14     80.0000
15     20.0000
16     85.0000
Name: Age, dtype: float64

In [46]:
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         0
dtype: int64

**Dealing Outliers in the Dataset**  
**Lambda Function**

In [47]:
df['Age']=df['Age'].apply(lambda x: x if x < 120 else df['Age'].median())

In [48]:
df['salary']=df['Salary'].apply(lambda x: x if x < 150000 else df['Salary'].median())

In [49]:
df['Designation']= df['Designation'].str.title()

In [50]:
avg_Gen_salary = df.groupby('Gender')['Salary'].mean()
avg_Gen_salary

Gender
F    301666.666667
M     83454.545455
Name: Salary, dtype: float64

In [51]:
avg_Dept_salary = df.groupby('Designation')['Salary'].median()
avg_Dept_salary

Designation
Analyst       45000.0
Engineer      90000.0
Professor    115000.0
Scientist     92500.0
Teacher       35000.0
Trainer       63000.0
Name: Salary, dtype: float64

In [52]:
avg_desig_age = df.groupby('Designation')['Age'].median()
avg_desig_age

Designation
Analyst      29.5
Engineer     29.0
Professor    37.0
Scientist    24.0
Teacher      55.0
Trainer      55.0
Name: Age, dtype: float64

In [53]:
high_salary= df[df['Salary']>100000]
high_salary

       Name Designation Gender   Age     Salary    salary
0   Mukhtar   Professor      M  37.0   115000.0  115000.0
4     Babar    Engineer      F  25.0  1500000.0   70000.0
7     Samra   Scientist      F  26.0   115000.0  115000.0
12    Ahsan     Trainer      M  30.0   110000.0  110000.0
15   Qaisar   Professor      M  20.0   170000.0   70000.0
16    Wajid    Engineer      M  85.0   190000.0   70000.0

In [54]:
df.sort_values(by='Age', ascending=True)

             Name Designation Gender   Age     Salary    salary
15         Qaisar   Professor      M  20.0   170000.0   70000.0
5            Aqsa   Scientist      F  22.0    70000.0   70000.0
4           Babar    Engineer      F  25.0  1500000.0   70000.0
7           Samra   Scientist      F  26.0   115000.0  115000.0
8            Eman    Engineer      F  28.0    35000.0   35000.0
2          Mohsin    Engineer      M  29.0    50000.0   50000.0
6           Rafia     Analyst      F  29.0    20000.0   20000.0
1           Azziz     Teacher      M  30.0    35000.0   35000.0
12          Ahsan     Trainer      M  30.0   110000.0  110000.0
3   Naveed Fatima     Analyst      F  30.0    70000.0   70000.0
11          Ahmed    Engineer      M  30.0    90000.0   90000.0
0         Mukhtar   Professor      M  37.0   115000.0  115000.0
9        Abdullah     Teacher      M  55.0    70000.0   70000.0
10          Mosib   Professor      M  60.0    70000.0   70000.0
13          Wajid     Teacher      M  67.0     2000.0    2000.0
14          Naeem     Trainer      M  80.0    16000.0   16000.0
16          Wajid    Engineer      M  85.0   190000.0   70000.0

In [55]:
df.sort_values(by='Age', ascending=False)

             Name Designation Gender   Age     Salary    salary
16          Wajid    Engineer      M  85.0   190000.0   70000.0
14          Naeem     Trainer      M  80.0    16000.0   16000.0
13          Wajid     Teacher      M  67.0     2000.0    2000.0
10          Mosib   Professor      M  60.0    70000.0   70000.0
9        Abdullah     Teacher      M  55.0    70000.0   70000.0
0         Mukhtar   Professor      M  37.0   115000.0  115000.0
1           Azziz     Teacher      M  30.0    35000.0   35000.0
11          Ahmed    Engineer      M  30.0    90000.0   90000.0
3   Naveed Fatima     Analyst      F  30.0    70000.0   70000.0
12          Ahsan     Trainer      M  30.0   110000.0  110000.0
2          Mohsin    Engineer      M  29.0    50000.0   50000.0
6           Rafia     Analyst      F  29.0    20000.0   20000.0
8            Eman    Engineer      F  28.0    35000.0   35000.0
7           Samra   Scientist      F  26.0   115000.0  115000.0
4           Babar    Engineer      F  25.0  1500000.0   70000.0
5            Aqsa   Scientist      F  22.0    70000.0   70000.0
15         Qaisar   Professor      M  20.0   170000.0   70000.0

In [56]:
df.to_csv('cleaned_data.csv', index=False)

In [57]:
df.describe()

             Age        Salary         salary
count  17.000000  1.700000e+01      17.000000
mean   40.176471  1.604706e+05   63411.764706
std    20.794336  3.490251e+05   33728.805982
min    20.000000  2.000000e+03    2000.000000
25%    28.000000  3.500000e+04   35000.000000
50%    30.000000  7.000000e+04   70000.000000
75%    55.000000  1.150000e+05   70000.000000
max    85.000000  1.500000e+06  115000.000000